app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "William"], ["email", "william.tam18@gmail.com"], ["created_at", 2016-06-29 08:05:50 UTC], ["updated_at", 2016-06-29 08:05:50 UTC]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save